## Titanic - Machine Learning from Disaster

- Let's use the [kaggle dataset](https://www.kaggle.com/competitions/titanic)

- It is a set of competition data, evaluated by accuracy

### Import the essential libraries

In [1]:
import numpy as np
import pandas as pd

### Taking the data and transforming it into a dataframe

In [5]:
path = '../../data/processed/'

train = pd.read_csv(f"{path}train.csv")
test = pd.read_csv(f"{path}test.csv")

- Just a look at the dataframe

In [6]:
train.sample(3)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
676          677         0       3  ...   8.05   NaN         S
889          890         1       1  ...  30.00  C148         C
339          340         0       1  ...  35.50     T         S

[3 rows x 12 columns]

In [7]:
test.sample(3)

     PassengerId  Pclass  ...  Cabin Embarked
57           949       3  ...  F G63        S
187         1079       3  ...    NaN        S
192         1084       3  ...    NaN        S

[3 rows x 11 columns]

### Exploratory data analysis

- Now we can start analyzing this base